CSI API ETABS v1

# cCaseHyperStaticGetBaseCase Method

---

Retrieves the base case for the specified hyperstatic load case

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetBaseCase(
    	string Name,
    	ref string HyperStaticCase
    )

    Function GetBaseCase (
    	Name As String,
    	ByRef HyperStaticCase As String
    ) As Integer

    Dim instance As cCaseHyperStatic
    Dim Name As String
    Dim HyperStaticCase As String
    Dim returnValue As Integer

    returnValue = instance.GetBaseCase(Name,
    	HyperStaticCase)

    int GetBaseCase(
    	String^ Name,
    	String^% HyperStaticCase
    )

    abstract GetBaseCase :
            Name : string *
            HyperStaticCase : string byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing hyperstatic load case

HyperStaticCase

    Type: SystemString
The name of an existing static linear load case that is the base case for the
specified hyperstatic load case

#### Return Value

Type: Int32
Returns zero if the base case is successfully retrieved; otherwise it returns
a nonzero value

Remarks

See Also

#### Reference

cCaseHyperStatic Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com